SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_syscfg.h
/* Bit fields for SYSCFG ROOTSESWVERSION */
#define _SYSCFG_ROOTSESWVERSION_RESETVALUE      0x00000000UL                            /**< Default value for SYSCFG_ROOTSESWVERSION    */
#define _SYSCFG_ROOTSESWVERSION_MASK            0xFFFFFFFFUL                            /**< Mask for SYSCFG_ROOTSESWVERSION             */
#define _SYSCFG_ROOTSESWVERSION_SWVERSION_SHIFT 0                                       /**< Shift value for SYSCFG_SWVERSION            */
#define _SYSCFG_ROOTSESWVERSION_SWVERSION_MASK  0xFFFFFFFFUL                            /**< Bit mask for SYSCFG_SWVERSION               */
#define _SYSCFG_ROOTSESWVERSION_SWVERSION_DEFAULT 0x00000000UL                            /**< Mode DEFAULT for SYSCFG_ROOTSESWVERSION     */
#define SYSCFG_ROOTSESWVERSION_SWVERSION_DEFAULT (_SYSCFG_ROOTSESWVERSION_SWVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for SYSCFG_ROOTSESWVERSION*/

/** @} End of group EFR32SG23_SYSCFG_BitFields */
/** @} End of group EFR32SG23_SYSCFG */
/**************************************************************************//**
 * @defgroup EFR32SG23_SYSCFG_CFGNS SYSCFG_CFGNS
 * @{
 * @brief EFR32SG23 SYSCFG_CFGNS Register Declaration.
 *****************************************************************************/

/** SYSCFG_CFGNS Register Declaration. */
typedef struct
{
        uint32_t             RESERVED0[7U];          /**< Reserved for future use                            */
  __IOM uint32_t             CFGNSTCALIB;            /**< Configure Non-Secure Sys-Tick cal.                 */
        uint32_t             RESERVED1[376U];   /**< Reserved for future use                            */
  __IOM uint32_t             ROOTNSDATA0;            /**< Data Register 0                                    */
  __IOM uint32_t             ROOTNSDATA1;            /**< Data Register 1                                    */
        uint32_t             RESERVED2[1U];          /**< Reserved for future use                            */
        uint32_t             RESERVED3[637U];   /**< Reserved for future use                            */
        uint32_t             RESERVED4[7U];          /**< Reserved for future use                            */
  __IOM uint32_t             CFGNSTCALIB_SET;        /**< Configure Non-Secure Sys-Tick cal.                 */
        uint32_t             RESERVED5[376U];   /**< Reserved for future use                            */
  __IOM uint32_t             ROOTNSDATA0_SET;        /**< Data Register 0                                    */
  __IOM uint32_t             ROOTNSDATA1_SET;        /**< Data Register 1                                    */
        uint32_t             RESERVED6[1U];          /**< Reserved for future use                            */
        uint32_t             RESERVED7[637U];   /**< Reserved for future use                            */
        uint32_t             RESERVED8[7U];          /**< Reserved for future use                            */
  __IOM uint32_t             CFGNSTCALIB_CLR;        /**< Configure Non-Secure Sys-Tick cal.                 */
        uint32_t             RESERVED9[376U];   /**< Reserved for future use                            */
  __IOM uint32_t             ROOTNSDATA0_CLR;        /**< Data Register 0                                    */
  __IOM uint32_t             ROOTNSDATA1_CLR;        /**< Data Register 1                                    */
        uint32_t             RESERVED10[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED11[637U];  /**< Reserved for future use                            */
        uint32_t             RESERVED12[7U];         /**< Reserved for future use                            */
  __IOM uint32_t             CFGNSTCALIB_TGL;        /**< Configure Non-Secure Sys-Tick cal.                 */
        uint32_t             RESERVED13[376U];  /**< Reserved for future use                            */
  __IOM uint32_t             ROOTNSDATA0_TGL;        /**< Data Register 0                                    */
  __IOM uint32_t             ROOTNSDATA1_TGL;        /**< Data Register 1                                    */
        uint32_t             RESERVED14[1U];         /**< Reserved for future use                            */
} SYSCFG_CFGNS_TypeDef;
/** @} End of group EFR32SG23_SYSCFG_CFGNS */

/**************************************************************************//**
 * @addtogroup EFR32SG23_SYSCFG_CFGNS
 * @{
 * @defgroup EFR32SG23_SYSCFG_CFGNS_BitFields SYSCFG_CFGNS Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for SYSCFG CFGNSTCALIB */
#define _SYSCFG_CFGNSTCALIB_RESETVALUE          0x01004A37UL                            /**< Default value for SYSCFG_CFGNSTCALIB        */
#define _SYSCFG_CFGNSTCALIB_MASK                0x03FFFFFFUL                            /**< Mask for SYSCFG_CFGNSTCALIB                 */
#define _SYSCFG_CFGNSTCALIB_TENMS_SHIFT         0                                       /**< Shift value for SYSCFG_TENMS                */
#define _SYSCFG_CFGNSTCALIB_TENMS_MASK          0xFFFFFFUL                              /**< Bit mask for SYSCFG_TENMS                   */
#define _SYSCFG_CFGNSTCALIB_TENMS_DEFAULT       0x00004A37UL                            /**< Mode DEFAULT for SYSCFG_CFGNSTCALIB         */
#define SYSCFG_CFGNSTCALIB_TENMS_DEFAULT        (_SYSCFG_CFGNSTCALIB_TENMS_DEFAULT << 0) /**< Shifted mode DEFAULT for SYSCFG_CFGNSTCALIB */
#define SYSCFG_CFGNSTCALIB_SKEW                 (0x1UL << 24)                           /**< Skew                                        */
#define _SYSCFG_CFGNSTCALIB_SKEW_SHIFT          24                                      /**< Shift value for SYSCFG_SKEW                 */
#define _SYSCFG_CFGNSTCALIB_SKEW_MASK           0x1000000UL                             /**< Bit mask for SYSCFG_SKEW                    */
#define _SYSCFG_CFGNSTCALIB_SKEW_DEFAULT        0x00000001UL                            /**< Mode DEFAULT for SYSCFG_CFGNSTCALIB         */
#define SYSCFG_CFGNSTCALIB_SKEW_DEFAULT         (_SYSCFG_CFGNSTCALIB_SKEW_DEFAULT << 24) /**< Shifted mode DEFAULT for SYSCFG_CFGNSTCALIB */
#define SYSCFG_CFGNSTCALIB_NOREF                (0x1UL << 25)                           /**< No Reference                                */
#define _SYSCFG_CFGNSTCALIB_NOREF_SHIFT         25                                      /**< Shift value for SYSCFG_NOREF                */
#define _SYSCFG_CFGNSTCALIB_NOREF_MASK          0x2000000UL                             /**< Bit mask for SYSCFG_NOREF                   */
#define _SYSCFG_CFGNSTCALIB_NOREF_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for SYSCFG_CFGNSTCALIB         */
#define _SYSCFG_CFGNSTCALIB_NOREF_REF           0x00000000UL                            /**< Mode REF for SYSCFG_CFGNSTCALIB             */
#define _SYSCFG_CFGNSTCALIB_NOREF_NOREF         0x00000001UL                            /**< Mode NOREF for SYSCFG_CFGNSTCALIB           */
#define SYSCFG_CFGNSTCALIB_NOREF_DEFAULT        (_SYSCFG_CFGNSTCALIB_NOREF_DEFAULT << 25) /**< Shifted mode DEFAULT for SYSCFG_CFGNSTCALIB */
#define SYSCFG_CFGNSTCALIB_NOREF_REF            (_SYSCFG_CFGNSTCALIB_NOREF_REF << 25)   /**< Shifted mode REF for SYSCFG_CFGNSTCALIB     */
#define SYSCFG_CFGNSTCALIB_NOREF_NOREF          (_SYSCFG_CFGNSTCALIB_NOREF_NOREF << 25) /**< Shifted mode NOREF for SYSCFG_CFGNSTCALIB   */

